In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [4]:
arr1 = np.arange(9).reshape(3,3)
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [6]:
np.concatenate([arr1,arr1],axis = 1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

Concatenation in Series

In [7]:
ser1 = Series([0,1,2],index = ['T','U','v'])
ser2 = Series([3,4],index = ['w','x'])

In [8]:
ser1

T    0
U    1
v    2
dtype: int64

In [9]:
ser2

w    3
x    4
dtype: int64

In [10]:
pd.concat([ser1,ser2])

T    0
U    1
v    2
w    3
x    4
dtype: int64

In [18]:
#adding keys
pd.concat([ser1,ser2],keys = ['cat1','cat2'])

cat1  T    0
      U    1
      v    2
cat2  w    3
      x    4
dtype: int64

Concatenation in DataFrames

In [11]:
dframe1 = DataFrame(np.random.randn(4,3),columns = ['x','y','z'])
dframe2 = DataFrame(np.random.randn(3,3),columns = ['y','q','z'])

In [12]:
dframe1

          x         y         z
0  1.113687 -0.529036 -0.435166
1  0.822960  1.023882 -0.084926
2 -0.522299  0.051836  0.720650
3 -1.305512  0.281436 -0.360975

In [13]:
dframe2

          y         q         z
0 -1.720040  0.027589  0.444483
1 -0.058079  1.581539 -0.748735
2 -2.857582 -0.630132 -1.693407

In [14]:
pd.concat([dframe1,dframe2])

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          q         x         y         z
0       NaN  1.113687 -0.529036 -0.435166
1       NaN  0.822960  1.023882 -0.084926
2       NaN -0.522299  0.051836  0.720650
3       NaN -1.305512  0.281436 -0.360975
0  0.027589       NaN -1.720040  0.444483
1  1.581539       NaN -0.058079 -0.748735
2 -0.630132       NaN -2.857582 -1.693407

In [15]:
pd.concat([dframe1,dframe2],ignore_index = True)
#added in a sequential order

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          q         x         y         z
0       NaN  1.113687 -0.529036 -0.435166
1       NaN  0.822960  1.023882 -0.084926
2       NaN -0.522299  0.051836  0.720650
3       NaN -1.305512  0.281436 -0.360975
4  0.027589       NaN -1.720040  0.444483
5  1.581539       NaN -0.058079 -0.748735
6 -0.630132       NaN -2.857582 -1.693407

In [19]:
pd.concat([dframe1,dframe2],axis=1)
#added in cols, axis=1

          x         y         z         y         q         z
0  1.113687 -0.529036 -0.435166 -1.720040  0.027589  0.444483
1  0.822960  1.023882 -0.084926 -0.058079  1.581539 -0.748735
2 -0.522299  0.051836  0.720650 -2.857582 -0.630132 -1.693407
3 -1.305512  0.281436 -0.360975       NaN       NaN       NaN

In [21]:
Sales1 = Series([10000,np.nan,20000,np.nan,30000,np.nan],
               index=['East','West','North','South','NorthEast','SouthEast'])
Sales1

East         10000.0
West             NaN
North        20000.0
South            NaN
NorthEast    30000.0
SouthEast        NaN
dtype: float64

In [24]:
Sales2 = Series([12000,14000,16000,18000,20000,22000],
               index=['East','West','North','South','NorthEast','SouthEast'])
Sales2

East         12000
West         14000
North        16000
South        18000
NorthEast    20000
SouthEast    22000
dtype: int64

In [25]:
#replace Null values in Sales1 with values in Sales2, otherwies retain the value in Sales1
Series(np.where(pd.isnull(Sales1),Sales2,Sales1),index=Sales1.index)

East         12000
West         14000
North        16000
South        18000
NorthEast    20000
SouthEast    22000
dtype: int64

In [26]:
nan = np.nan
dframe_Sales1 = DataFrame({'East': [1500,nan,3500,nan],
                            'West':[nan,4500,nan,5500],
                            'South':[6500,nan,7500,nan]})
dframe_Sales1

     East    West   South
0  1500.0     NaN  6500.0
1     NaN  4500.0     NaN
2  3500.0     NaN  7500.0
3     NaN  5500.0     NaN

In [27]:
dframe_Sales2 = DataFrame({'East':[1200,1300,nan,1600,1800],
                            'West':[nan,5000,6000,7000,8000]})
dframe_Sales2

     East    West
0  1200.0     NaN
1  1300.0  5000.0
2     NaN  6000.0
3  1600.0  7000.0
4  1800.0  8000.0

In [28]:
dframe_Sales1.combine_first(dframe_Sales2)

     East   South    West
0  1500.0  6500.0     NaN
1  1300.0     NaN  4500.0
2  3500.0  7500.0  6000.0
3  1600.0     NaN  5500.0
4  1800.0     NaN  8000.0